In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# Data Analysis on School Dosage

1. Acquire
2. Prepare
3. Explore
4. Model
5. Deliver

# Acquire

In [2]:
df = pd.read_excel('Cumulative Monthly Dosage (1).xlsx')

In [3]:
df.head()

,Monthly_Dosage_Minutes,Month_Year,Section_IA,CY_Student_ID,Student_School_Name,SCHOOL_ID,SITE_NAME,Cumulative_Monthly_Dosage
0,50,2015 09,ELA/Literacy,CY-104230,Winbourne Elementary School,A0232956,Baton Rouge,50
1,245,2015 10,ELA/Literacy,CY-104230,Winbourne Elementary School,A0232956,Baton Rouge,295
2,150,2015 11,ELA/Literacy,CY-104230,Winbourne Elementary School,A0232956,Baton Rouge,445
3,130,2015 12,ELA/Literacy,CY-104230,Winbourne Elementary School,A0232956,Baton Rouge,575
4,270,2016 01,ELA/Literacy,CY-104230,Winbourne Elementary School,A0232956,Baton Rouge,845

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3178 entries, 0 to 3177
Data columns (total 8 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Monthly_Dosage_Minutes     3178 non-null   int64
 1   Month_Year                 3178 non-null   object
 2   Section_IA                 3178 non-null   object
 3   CY_Student_ID              3178 non-null   object
 4   Student_School_Name        3178 non-null   object
 5   SCHOOL_ID                  3178 non-null   object
 6   SITE_NAME                  3178 non-null   object
 7   Cumulative_Monthly_Dosage  3178 non-null   int64
dtypes: int64(2), object(6)
memory usage: 198.8+ KB

In [5]:
df.describe()

       Monthly_Dosage_Minutes  Cumulative_Monthly_Dosage
count             3178.000000                3178.000000
mean               176.798301                 520.978603
std                127.217625                 423.129057
min                 15.000000                  15.000000
25%                 85.000000                 180.000000
50%                150.000000                 435.000000
75%                235.000000                 765.000000
max                870.000000                3570.000000

# Prepare